Revit 2027 API
EnergyAnalysisOpening.GetAnalyticalSurface Method
 Gets the associative analytical parent surface element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EnergyAnalysisSurface GetAnalyticalSurface()
Public Function GetAnalyticalSurface As EnergyAnalysisSurface
public:
EnergyAnalysisSurface^ GetAnalyticalSurface()
member GetAnalyticalSurface : unit -> EnergyAnalysisSurface
Return Value
EnergyAnalysisSurface
 The associative analytical parent surface element.
See Also
Reference
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace